Repository: autohotkey-docs-translation/v1-nl
Catalog: omegat/project_save.tmx
Source language: en
Languages: nl

source: This document describes features added in the AutoHotkey_L branch of AutoHotkey development, now simply known as "AutoHotkey 1.1".
nl: Dit document beschrijft de nieuwe functionaliteiten die toegevoegd zijn in de AutoHotkey_L branch van AutoHotkey ontwikkeling, nu gekend als "AutoHotkey 1.1".

source: This is either 4 (32-bit) or 8 (64-bit).
nl: Dit is ofwel 4 (32-bit) of 8 (64-bit).

source: This page contains information about the currently used version, the authors, the license, and a quick overview of the documentation.
nl: Deze pagina bevat informatie over de huidige versie, de auteurs, de licentie en een kort overzicht van de documentatie.

source: Throws an exception.
nl: Geeft een uitzondering terug.

source: To open a script for editing, right-click on the script file and select Edit Script.
nl: Om een script te bewerken, klik rechts op de bestandsnaam en kies Edit Script.

source: Tray Icon
nl: Systeem icoon

source: Trims certain characters from the beginning and/or end of a string.
nl: Verwijdert bepaalde karakters van het begin en/of het einde van de string.

source: Try/catch/throw and increased usefulness for A_LastError.
nl: Try/catch/throw een verhoogde bruikbaarheid voorA_LastError.

source: Tutorial for beginners
nl: Handleiding voor beginners

source: Unicode characters may be used directly in Unicode builds.
nl: Unicode karakters kunnen direct gebruikt worden in Unicode builds.

source: Unusual Sizes
nl: Uitzonderlijke grootte

source: Using Unicode in script files.
nl: Het gebruik van Unicode in script bestanden.

source: Using Unicode with SendInput.
nl: Unicode gebruiken met SendInput.

source: Using the Program
nl: Het programma gebruiken

source: Using the Program | AutoHotkey
nl: Hoe moet je het programma gebruiken | AutoHotkey

source: Variables
nl: Variabelen

source: Variables and expressions
nl: Variabelen en expressies

source: Various enhancements to the Gui command and related.
nl: Verscheidene verbeteringen aan de Gui command en gerelateerd.

source: Version
nl: Versie

source: When multiple sized icon resources exist within an icon group, the most appropriate size is used.
nl: wanneer meerdere grootte icon bronnen bestaan binnenin een groep van icon, de meest geschikte grootte wordt gebruikt.

source: While nnn must be a numeric code page identifier, Encoding follows the same format as FileEncoding.
nl: nnn moet een een nummer code page identifier zijn, Encoding volgt hetzelfde patroon, formaat, als FileEncoding.

source: Windows can be identified by the name or path of the process (EXE file) which owns them.
nl: Windows kan geïdentificeerd worden door de naam van het pad of het process (EXE file) die bij hem hoort.

source: With AutoHotkey installed, there are several ways to run a script:
nl: Wanneer AutoHotkey is geinstalleerd, zijn er enkele manieren om een script te starten:

source: Wraps a value and type to pass as a parameter.
nl: Wikkel en waarde en type om als parameters door te geven.

source: Wraps/unwraps a COM object.
nl: Pakt een COM object in/uit.

source: You can then type a name for the script (taking care not to erase the .ahk extension if it is visible).
nl: Nu kan je de naam van het script typen (zorg ervoor dat je de extensie .ahk niet verwijderd als het zichtbaar is).

source: en
nl: nl

source: explanations of various things you need to know.
nl: Uitleg over verschillende dingen die je moet weten.

source: how to write scripts.
nl: Hoe schrijf je een scripts.

source: if WinExist("Untitled - Notepad")
nl: if WinExist("Naamloos - Kladblok")

source: lib/ComObjFlags.htm
nl: aflib/ComObjFlags.htm

source: ©2003-2014 Chris Mallett, portions ©AutoIt Team and the AHK community
nl: ©2003-2014 Chris Mallett, portions ©AutoIt Team en de AHK gemeenschap
